>Input the two csv files
>Union the files together
>Convert the Date field to a Quarter Number instead
Name this field Quarter
>Aggregate the data in the following ways:
Median price per Quarter, Flow Card? and Class
Minimum price per Quarter, Flow Card? and Class
Maximum price per Quarter, Flow Card? and Class
>Create three separate flows where you have only one of the aggregated measures in each. 
One for the minimum price
One for the median price
One for the maximum price
>Now pivot the data to have a column per class for each quarter and whether the passenger had a flow card or not
>Union these flows back together
>Change the name of the following columns:
Economy to First
First Class to Economy
Business Class to Premium
Premium Economy to Business

In [76]:
import pandas as pd
import numpy as np
import datetime as dt

>Input the two csv files

In [137]:
df1= pd.read_csv('PD 2024 Wk 1 Output Flow Card.csv')
df2= pd.read_csv('PD 2024 Wk 1 Output Non-Flow Card.csv')

>Union the files together

In [138]:
df= pd.concat([df1,df2],ignore_index= True)

In [139]:
df['Date'] = pd.to_datetime(df['Date'])

C:\Users\Niveatha\AppData\Local\Temp\ipykernel_49360\2394721818.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['Date'] = pd.to_datetime(df['Date'])

In [140]:
df.dtypes

Date             datetime64[ns]
Flight Number            object
From                     object
To                       object
Class                    object
Price                   float64
Flow Card?               object
Bags Checked              int64
Meal Type                object
dtype: object

>Convert the Date field to a Quarter Number instead
Name this field Quarter

In [141]:
df['Date']= df['Date'].dt.quarter

In [142]:
df.rename(columns={'Date': 'Quarter', 'Flow Card?':'Flow card'}, inplace= True)

>Aggregate the data in the following ways:
Median price per Quarter, Flow Card? and Class
Minimum price per Quarter, Flow Card? and Class
Maximum price per Quarter, Flow Card? and Class

In [143]:
median_price= df.groupby(['Flow card','Quarter','Class'])['Price'].median()

In [144]:
min_price=df.groupby(['Flow card','Quarter','Class'])['Price'].min()

In [145]:
max_price=df.groupby(['Flow card','Quarter','Class'])['Price'].max()

In [146]:
median_price=pd.DataFrame(median_price)
median_price.head()

                                    Price
Flow card Quarter Class
No        1       Business Class    556.2
                  Economy          2285.0
                  First Class       437.5
                  Premium Economy  1177.5
          2       Business Class    544.8

In [147]:
median_price=median_price.pivot_table(index=['Flow card','Quarter'],columns= 'Class', values='Price')

In [148]:
median_price.head()

Class              Business Class  Economy  First Class  Premium Economy
Flow card Quarter
No        1                 556.2   2285.0        437.5          1177.50
          2                 544.8   2345.0        440.5          1176.25
          3                 490.8   2245.0        511.5          1080.00
          4                 597.6   2275.0        427.0          1130.00
Yes       1                 550.8   2272.5        437.5          1146.25

>Create three separate flows where you have only one of the aggregated measures in each. 
One for the minimum price
One for the median price
One for the maximum price

>Now pivot the data to have a column per class for each quarter and whether the passenger had a flow card or not

In [149]:
min_price=pd.DataFrame(min_price)
min_price=min_price.pivot_table(index=['Flow card','Quarter'],columns= 'Class', values='Price')

In [150]:
max_price=pd.DataFrame(max_price)
max_price=max_price.pivot_table(index=['Flow card','Quarter'],columns= 'Class', values='Price')

>Union these flows back together

In [151]:
main_df=pd.concat([median_price,min_price,max_price])
main_df= pd.DataFrame(main_df)

In [155]:
main_df.shape

(24, 4)

In [157]:
main_df.head()

Class              Business Class  Economy  First Class  Premium Economy
Flow card Quarter
No        1                 556.2   2285.0        437.5          1177.50
          2                 544.8   2345.0        440.5          1176.25
          3                 490.8   2245.0        511.5          1080.00
          4                 597.6   2275.0        427.0          1130.00
Yes       1                 550.8   2272.5        437.5          1146.25

>Change the name of the following columns:
Economy to First
First Class to Economy
Business Class to Premium
Premium Economy to Business

In [158]:
main_df.rename(columns={'Economy':'First Class',
                         'First Class': 'Economy',
                         'Business Class': 'Premium Economy',
                         'Premium Economy': 'Business' })

Class              Premium Economy  First Class  Economy  Business
Flow card Quarter
No        1                  556.2       2285.0    437.5   1177.50
          2                  544.8       2345.0    440.5   1176.25
          3                  490.8       2245.0    511.5   1080.00
          4                  597.6       2275.0    427.0   1130.00
Yes       1                  550.8       2272.5    437.5   1146.25
          2                  511.8       2300.0    440.0   1131.25
          3                  530.4       2387.5    476.0   1050.00
          4                  526.2       2160.0    441.0   1127.50
No        1                  246.0       1000.0    200.0    532.50
          2                  240.0       1000.0    202.0    507.50
          3                  240.0       1000.0    201.0    515.00
          4                  240.0       1015.0    201.0    527.50
Yes       1                  243.6       1020.0    201.0    502.50
          2                  240.0       1005.0    200.0    500.00
          3                  241.2       1020.0    205.0    502.50
          4                  241.2       1030.0    205.0    505.00
No        1                  834.0       3445.0    699.0   1722.50
          2                  838.8       3480.0    694.0   1745.00
          3                  835.2       3455.0    698.0   1747.50
          4                  835.2       3465.0    691.0   1730.00
Yes       1                  840.0       3500.0    698.0   1737.50
          2                  837.6       3490.0    693.0   1750.00
          3                  840.0       3495.0    697.0   1727.50
          4                  834.0       3410.0    697.0   1737.50